funkBuild/esp_idf_timeseries/test_app/sdkconfig.defaults
# ESP IDF Timeseries Test Configuration

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash Configuration - 16MB for QEMU
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM disabled for QEMU
# CONFIG_SPIRAM is not set

# Heap tracing for memory leak detection
CONFIG_HEAP_TRACING_STANDALONE=y

# Unity test framework
CONFIG_UNITY_ENABLE_FLOAT=y
CONFIG_UNITY_ENABLE_DOUBLE=y
CONFIG_UNITY_ENABLE_64BIT=y
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y

# Disable task watchdog during tests
CONFIG_ESP_TASK_WDT_EN=n

# Compiler Optimization - Use O2 for performance testing
CONFIG_COMPILER_OPTIMIZATION_PERF=y
